Revit 2018 API
RebarWorkInstructions Enumeration
 Dictates how shape matching works for bars that are bent vs bars that are straight
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.0)
Syntax
C#
public enum RebarWorkInstructions
Visual Basic
Public Enumeration RebarWorkInstructions
Visual C++
public enum class RebarWorkInstructions
Members
Member name | Description
Bent |  the bar is bent in the shop
Straight |  the bar is shipped straight and bent on site
See Also
Autodesk.Revit.DB.Structure Namespace